In [6]:
import pandas as pd
import numpy as np

In [2]:
import sys

In [3]:
#some important Series methods

In [6]:
#astype
subs=pd.read_csv("C:/subs.csv")
subs

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [7]:
subs.astype

<bound method NDFrame.astype of      Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]>

In [30]:
vk=pd.read_csv("C:/kohli_ipl.csv")

In [31]:
vk

     match_no  runs
0           1     1
1           2    23
2           3    13
3           4    12
4           5     1
..        ...   ...
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

[215 rows x 2 columns]

In [26]:
df = pd.DataFrame(vk)

# Convert column 'A' into a Series
series = df['match_no']

print(series)

0        1
1        2
2        3
3        4
4        5
      ...
210    211
211    212
212    213
213    214
214    215
Name: match_no, Length: 215, dtype: int64

In [44]:
movies=pd.read_csv("C:/bollywood.csv")

In [45]:
movies

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]

In [13]:
import sys
sys.getsizeof(vk)

3604

In [15]:
sys.getsizeof(vk.astype('int16'))

1024

In [16]:
#between

In [27]:
series[series.between(51,99)].size

49

In [28]:
#drop duplicates

In [29]:
temp=pd.Series([1,1,2,2,3,3,4,4,4])
temp

0    1
1    1
2    2
3    2
4    3
5    3
6    4
7    4
8    4
dtype: int64

In [35]:
temp.drop_duplicates()

0    1
2    2
4    3
6    4
dtype: int64

In [37]:
temp.drop_duplicates(keep='first')

0    1
2    2
4    3
6    4
dtype: int64

In [38]:
temp.drop_duplicates(keep='last')

1    1
3    2
5    3
8    4
dtype: int64

In [39]:
movies.drop_duplicates()

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1497 rows x 2 columns]

In [44]:
temp.duplicated().sum()   #--> no of duplicated values

5

In [46]:
movies.duplicated().sum()

3

In [2]:
#null

In [7]:
temp=pd.Series([1,np.nan,2,3,4,5,np.nan,8,9,np.nan])
temp

0    1.0
1    NaN
2    2.0
3    3.0
4    4.0
5    5.0
6    NaN
7    8.0
8    9.0
9    NaN
dtype: float64

In [13]:
temp.size

10

In [14]:
temp.count()

7

In [15]:
#note count() and size() fxn count fxn will count all the values including missing values.

In [21]:
temp.isnull()   #to find missing values

0    False
1     True
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9     True
dtype: bool

In [22]:
temp.isnull().sum()   #total number of missing values in the data

3

In [23]:
#dropna  --> to remove the missing values from the dataset
temp.dropna()

0    1.0
2    2.0
3    3.0
4    4.0
5    5.0
7    8.0
8    9.0
dtype: float64

In [24]:
#fillna  -->if we don't want to remove the missing values we can fill the missing values with some data like
temp.fillna(0)

0    1.0
1    0.0
2    2.0
3    3.0
4    4.0
5    5.0
6    0.0
7    8.0
8    9.0
9    0.0
dtype: float64

In [27]:
temp.fillna(temp.mean())

0    1.0
1    4.0
2    2.0
3    3.0
4    4.0
5    5.0
6    4.0
7    8.0
8    9.0
9    4.0
dtype: float64

In [28]:
#isin

In [37]:
vk[(vk==49) | (vk==99)]

     match_no  runs
0         NaN   NaN
1         NaN   NaN
2         NaN   NaN
3         NaN   NaN
4         NaN   NaN
..        ...   ...
210       NaN   NaN
211       NaN   NaN
212       NaN   NaN
213       NaN   NaN
214       NaN   NaN

[215 rows x 2 columns]

In [41]:
vk[vk.isin([49,99])]

     match_no  runs
0         NaN   NaN
1         NaN   NaN
2         NaN   NaN
3         NaN   NaN
4         NaN   NaN
..        ...   ...
210       NaN   NaN
211       NaN   NaN
212       NaN   NaN
213       NaN   NaN
214       NaN   NaN

[215 rows x 2 columns]

In [42]:
#apply

In [46]:
movies

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]

In [51]:
#movies.apply(lambda x:x.split()[0].upper())

In [ ]:
subs